I see the same behavior with awscc_fis_experiment_template.

Apply once, make no code changes, then run a plan, and I get a lot of noise:

```
Terraform will perform the following actions:
  # awscc_fis_experiment_template.terminate_one_eks_node will be updated in-place
  ~ resource "awscc_fis_experiment_template" "terminate_one_eks_node" {
      ~ actions           = {
          ~ "TerminateInstance" = {
              + parameters  = {}
              + start_after = (known after apply)
                # (3 unchanged attributes hidden)
            },
        }
        id                = "EXT8q2JVttaXFR2HW"
      ~ log_configuration = {
          + s3_configuration              = {
              + bucket_name = (known after apply)
              + prefix      = (known after apply)
            }
            # (2 unchanged attributes hidden)
        }
      ~ stop_conditions   = [
          ~ {
              + value  = (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        tags              = {
            "Name" = "eks-node-terminate"
        }
      ~ targets           = {
          ~ "Instances-Target-1" = {
              + filters        = [
                ] -> (known after apply)
              + parameters     = (known after apply)
              + resource_arns  = (known after apply)
                # (3 unchanged attributes hidden)
            },
        }
        # (2 unchanged attributes hidden)
    }
```

Then when I apply with this plan, terraform is stuck on modifying until my pipeline times out.

```
...
awscc_fis_experiment_template.terminate_one_eks_node: Still modifying... [id=EXT8q2JVttaXFR2HW, 10m40s elapsed]
awscc_fis_experiment_template.terminate_one_eks_node: Still modifying... [id=EXT8q2JVttaXFR2HW, 10m50s elapsed]
awscc_fis_experiment_template.terminate_one_eks_node: Still modifying... [id=EXT8q2JVttaXFR2HW, 11m0s elapsed]
awscc_fis_experiment_template.terminate_one_eks_node: Still modifying... [id=EXT8q2JVttaXFR2HW, 11m10s elapsed]
...
```

I can't imagine that a resource as small as an FIS experiment template should take more than a second or two to modify.